Revit 2027 API
VertexBuffer Constructor
 Constructs the vertex buffer with the given capacity, measured in floats.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexBuffer(
	int sizeInFloats
)
Public Sub New (
	sizeInFloats As Integer
)
public:
VertexBuffer(
	int sizeInFloats
)
new :
        sizeInFloats : int -> VertexBuffer
Parameters
sizeInFloats Int32
 The number of floats that the buffer can contain.
Exceptions
Exception | Condition
InvalidOperationException |  This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
Reference
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace